///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


import React from "react";
import {MultiContexts} from "./MultiContexts";
import {SingleContext} from "./SingleContext";


//-------------------------------------------------------------------------------------------------------------------//


/**
 * Old Context
 *
 *
 * 旧版 Context API 存在严重的效率问题，并且容易导致数据滥用
 */


//- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -//


function OldContext(props) {

    return (

        <React.Fragment>
            <SingleContext/>
            <hr/>
            <MultiContexts/>
        </React.Fragment>
    );
}


//- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -//


export {

    OldContext
};


///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////