///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


import {CALL_HISTORY_METHOD} from "./actionTypes";


//-------------------------------------------------------------------------------------------------------------------//


/** 利用中间件中 监听指定方法，并调用 history 中的对应方法 **/

export default history => store => next => action => {

    if (action.type === CALL_HISTORY_METHOD) {

        const {method, args} = action.payload;

        history[method](...args);

    } else {

        next(action);
    }
};


///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
